Ran Plan for project: `cco-tf-demo` dir: `infrastructure` workspace: `default`

<details><summary>Show Output</summary>

```diff
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-020841e2c74178ed8]
aws_s3_bucket.log: Refreshing state... [id=cco-tf-demo-log-staging]
aws_cloudwatch_log_group.cloudtrail: Refreshing state... [id=cloudtrail/cco-tf-example]
module.vpc.aws_iam_role.vpc_flow_log_cloudwatch[0]: Refreshing state... [id=vpc-flow-log-role-20210222144352777600000001]
module.vpc.aws_iam_policy.vpc_flow_log_cloudwatch[0]: Refreshing state... [id=arn:aws:iam::966064235577:policy/vpc-flow-log-to-cloudwatch-20210222144352779900000002]
aws_iam_role.instances: Refreshing state... [id=instances]
aws_iam_role.cloudtrail: Refreshing state... [id=AccountBaseline-CloudTrail-CloudWatchLogs-Role]
module.vpc.aws_iam_role_policy_attachment.vpc_flow_log_cloudwatch[0]: Refreshing state... [id=vpc-flow-log-role-20210222144352777600000001-20210222144353319900000004]
aws_iam_instance_profile.profile: Refreshing state... [id=SSM-ROLE]
aws_iam_role_policy_attachment.ssm: Refreshing state... [id=instances-20210222144353175500000003]
aws_iam_role_policy.cloudtrail: Refreshing state... [id=AccountBaseline-CloudTrail-CloudWatchLogs-Role:AccountBaseline-CloudTrail-CloudWatchLogsGroup-Policy]
aws_s3_bucket_public_access_block.logging: Refreshing state... [id=cco-tf-demo-log-staging]
aws_s3_bucket.cloudtrail: Refreshing state... [id=cco-tf-demo-cloudtrail-staging]
aws_s3_bucket_policy.logging: Refreshing state... [id=cco-tf-demo-log-staging]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-060d6af86f9351b21]
module.vpc.aws_route_table.private[4]: Refreshing state... [id=rtb-09ff56cbd3383e828]
module.vpc.aws_cloudwatch_log_group.flow_log[0]: Refreshing state... [id=/aws/vpc-flow-log/vpc-020841e2c74178ed8]
module.vpc.aws_route_table.private[3]: Refreshing state... [id=rtb-08b21614179af2ea6]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-009ba9c41b9c7da4c]
module.vpc.aws_route_table.private[2]: Refreshing state... [id=rtb-0ac987108fa00c25e]
aws_security_group.app: Refreshing state... [id=sg-0c18aab4d9190361d]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-09f926d4d343937f2]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-068806118724ae6d2]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0dec573754affe324]
module.vpc.aws_subnet.public[3]: Refreshing state... [id=subnet-0b68e6fcbe9a1d99e]
module.vpc.aws_subnet.public[4]: Refreshing state... [id=subnet-0895d36db4e810981]
module.vpc.aws_route_table.database[4]: Refreshing state... [id=rtb-07c60e1d33cc3e6f9]
module.vpc.aws_route_table.database[0]: Refreshing state... [id=rtb-0af195971be496336]
module.vpc.aws_route_table.database[1]: Refreshing state... [id=rtb-07aa06d872cb755af]
module.vpc.aws_route_table.database[2]: Refreshing state... [id=rtb-0d0d40f5e764329c9]
module.vpc.aws_route_table.database[3]: Refreshing state... [id=rtb-08b428f0407a1582e]
module.vpc.aws_subnet.private[4]: Refreshing state... [id=subnet-0494d52362072a6db]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-0b031261b2f40a9af]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0534cbdf24f7218b5]
module.vpc.aws_subnet.private[3]: Refreshing state... [id=subnet-02a821156bb5cead7]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0cf9ddd4d6c25261e]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-098b6238f02422d75]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-09baa7a2d69c65e15]
module.vpc.aws_subnet.database[1]: Refreshing state... [id=subnet-01c92627bb796a0d5]
module.vpc.aws_subnet.database[3]: Refreshing state... [id=subnet-038bda2e91bd3a464]
module.vpc.aws_subnet.database[2]: Refreshing state... [id=subnet-09f3f71386d94842c]
aws_security_group.bastion: Refreshing state... [id=sg-0bfd195805f8ff32b]
module.vpc.aws_subnet.database[4]: Refreshing state... [id=subnet-0a4610df96422daf9]
module.vpc.aws_subnet.database[0]: Refreshing state... [id=subnet-0763e741532f02f47]
module.vpc.aws_route_table_association.public[3]: Refreshing state... [id=rtbassoc-09d5f69e7a23cd4b5]
module.vpc.aws_route_table_association.public[4]: Refreshing state... [id=rtbassoc-0f3392a0034459f35]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-089c55e7d9f297fc6]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-00133f0b9d8269cc8]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-077569fccd1324aa5]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0534cbdf24f7218b51080289494]
module.vpc.aws_flow_log.this[0]: Refreshing state... [id=fl-05835fb26f52440ce]
aws_s3_bucket_public_access_block.cloudtrail: Refreshing state... [id=cco-tf-demo-cloudtrail-staging]
module.vpc.aws_route_table_association.database[0]: Refreshing state... [id=rtbassoc-0eaa6d3fd2b2c76cd]
module.vpc.aws_route_table_association.database[2]: Refreshing state... [id=rtbassoc-09d7ceac7cf61bd68]
module.vpc.aws_route_table_association.database[3]: Refreshing state... [id=rtbassoc-0c939f7e049cd2c00]
module.vpc.aws_route_table_association.database[1]: Refreshing state... [id=rtbassoc-06097c06ee6dddee2]
module.vpc.aws_route_table_association.database[4]: Refreshing state... [id=rtbassoc-0c5387251a01b43e3]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0fe44e0c7dd1e9286]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-07ff7c8874242e1d5]
module.vpc.aws_route_table_association.private[4]: Refreshing state... [id=rtbassoc-0c9ceb69ba8df46b8]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-0d533b035d7447717]
module.vpc.aws_route_table_association.private[3]: Refreshing state... [id=rtbassoc-0b72c21be430d5b58]
module.vpc.aws_db_subnet_group.database[0]: Refreshing state... [id=cco-tf-demo]
aws_instance.app: Refreshing state... [id=i-05e799d1f927e2080]
aws_s3_bucket_policy.cloudtrail: Refreshing state... [id=cco-tf-demo-cloudtrail-staging]
aws_security_group.db: Refreshing state... [id=sg-095c2bd58e5353973]
aws_cloudtrail.cloudtrail: Refreshing state... [id=cco-tf-example]
aws_cloudwatch_metric_alarm.app_1_system_status_check: Refreshing state... [id=EC2AutoRecover-i-05e799d1f927e2080]
aws_instance.db: Refreshing state... [id=i-0418b9da89fdc49f1]
aws_cloudwatch_metric_alarm.db_1_system_status_check: Refreshing state... [id=EC2AutoRecover-i-0418b9da89fdc49f1]
aws_instance.bastion: Refreshing state... [id=i-0a707a70b6ae1b4e3]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
+ create
~ update in-place
- destroy

Terraform will perform the following actions:

  # module.vpc.aws_eip.nat[0] will be created
+ resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name" = "cco-tf-demo-us-east-1a"
        }
      + vpc                  = true
    }

  # module.vpc.aws_nat_gateway.this[0] will be created
+ resource "aws_nat_gateway" "this" {
      + allocation_id        = (known after apply)
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = "subnet-0dec573754affe324"
      + tags                 = {
          + "Name" = "cco-tf-demo-us-east-1a"
        }
    }

  # module.vpc.aws_route.private_nat_gateway[0] will be created
+ resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block     = "0.0.0.0/0"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + local_gateway_id           = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = "rtb-060d6af86f9351b21"
      + state                      = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.aws_route_table.database[0] will be updated in-place
~ resource "aws_route_table" "database" {
        id               = "rtb-0af195971be496336"
      ~ tags             = {
          ~ "Name" = "cco-tf-demo-db-us-east-1a" -> "cco-tf-demo-db"
        }
        # (4 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table.database[1] will be destroyed
- resource "aws_route_table" "database" {
      - id               = "rtb-07aa06d872cb755af" -> null
      - owner_id         = "966064235577" -> null
      - propagating_vgws = [] -> null
      - route            = [] -> null
      - tags             = {
          - "Name" = "cco-tf-demo-db-us-east-1b"
        } -> null
      - vpc_id           = "vpc-020841e2c74178ed8" -> null
    }

  # module.vpc.aws_route_table.database[2] will be destroyed
- resource "aws_route_table" "database" {
      - id               = "rtb-0d0d40f5e764329c9" -> null
      - owner_id         = "966064235577" -> null
      - propagating_vgws = [] -> null
      - route            = [] -> null
      - tags             = {
          - "Name" = "cco-tf-demo-db-us-east-1c"
        } -> null
      - vpc_id           = "vpc-020841e2c74178ed8" -> null
    }

  # module.vpc.aws_route_table.database[3] will be destroyed
- resource "aws_route_table" "database" {
      - id               = "rtb-08b428f0407a1582e" -> null
      - owner_id         = "966064235577" -> null
      - propagating_vgws = [] -> null
      - route            = [] -> null
      - tags             = {
          - "Name" = "cco-tf-demo-db-us-east-1d"
        } -> null
      - vpc_id           = "vpc-020841e2c74178ed8" -> null
    }

  # module.vpc.aws_route_table.database[4] will be destroyed
- resource "aws_route_table" "database" {
      - id               = "rtb-07c60e1d33cc3e6f9" -> null
      - owner_id         = "966064235577" -> null
      - propagating_vgws = [] -> null
      - route            = [] -> null
      - tags             = {
          - "Name" = "cco-tf-demo-db-us-east-1e"
        } -> null
      - vpc_id           = "vpc-020841e2c74178ed8" -> null
    }

  # module.vpc.aws_route_table.private[0] will be updated in-place
~ resource "aws_route_table" "private" {
        id               = "rtb-060d6af86f9351b21"
      ~ tags             = {
          ~ "Name" = "cco-tf-demo-private-us-east-1a" -> "cco-tf-demo-private"
        }
        # (4 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table.private[1] will be destroyed
- resource "aws_route_table" "private" {
      - id               = "rtb-009ba9c41b9c7da4c" -> null
      - owner_id         = "966064235577" -> null
      - propagating_vgws = [] -> null
      - route            = [] -> null
      - tags             = {
          - "Name" = "cco-tf-demo-private-us-east-1b"
        } -> null
      - vpc_id           = "vpc-020841e2c74178ed8" -> null
    }

  # module.vpc.aws_route_table.private[2] will be destroyed
- resource "aws_route_table" "private" {
      - id               = "rtb-0ac987108fa00c25e" -> null
      - owner_id         = "966064235577" -> null
      - propagating_vgws = [] -> null
      - route            = [] -> null
      - tags             = {
          - "Name" = "cco-tf-demo-private-us-east-1c"
        } -> null
      - vpc_id           = "vpc-020841e2c74178ed8" -> null
    }

  # module.vpc.aws_route_table.private[3] will be destroyed
- resource "aws_route_table" "private" {
      - id               = "rtb-08b21614179af2ea6" -> null
      - owner_id         = "966064235577" -> null
      - propagating_vgws = [] -> null
      - route            = [] -> null
      - tags             = {
          - "Name" = "cco-tf-demo-private-us-east-1d"
        } -> null
      - vpc_id           = "vpc-020841e2c74178ed8" -> null
    }

  # module.vpc.aws_route_table.private[4] will be destroyed
- resource "aws_route_table" "private" {
      - id               = "rtb-09ff56cbd3383e828" -> null
      - owner_id         = "966064235577" -> null
      - propagating_vgws = [] -> null
      - route            = [] -> null
      - tags             = {
          - "Name" = "cco-tf-demo-private-us-east-1e"
        } -> null
      - vpc_id           = "vpc-020841e2c74178ed8" -> null
    }

  # module.vpc.aws_route_table_association.database[1] will be updated in-place
~ resource "aws_route_table_association" "database" {
        id             = "rtbassoc-06097c06ee6dddee2"
      ~ route_table_id = "rtb-07aa06d872cb755af" -> "rtb-0af195971be496336"
        # (1 unchanged attribute hidden)
    }

  # module.vpc.aws_route_table_association.database[2] will be updated in-place
~ resource "aws_route_table_association" "database" {
        id             = "rtbassoc-09d7ceac7cf61bd68"
      ~ route_table_id = "rtb-0d0d40f5e764329c9" -> "rtb-0af195971be496336"
        # (1 unchanged attribute hidden)
    }

  # module.vpc.aws_route_table_association.database[3] will be updated in-place
~ resource "aws_route_table_association" "database" {
        id             = "rtbassoc-0c939f7e049cd2c00"
      ~ route_table_id = "rtb-08b428f0407a1582e" -> "rtb-0af195971be496336"
        # (1 unchanged attribute hidden)
    }

  # module.vpc.aws_route_table_association.database[4] will be updated in-place
~ resource "aws_route_table_association" "database" {
        id             = "rtbassoc-0c5387251a01b43e3"
      ~ route_table_id = "rtb-07c60e1d33cc3e6f9" -> "rtb-0af195971be496336"
        # (1 unchanged attribute hidden)
    }

  # module.vpc.aws_route_table_association.private[1] will be updated in-place
~ resource "aws_route_table_association" "private" {
        id             = "rtbassoc-07ff7c8874242e1d5"
      ~ route_table_id = "rtb-009ba9c41b9c7da4c" -> "rtb-060d6af86f9351b21"
        # (1 unchanged attribute hidden)
    }

  # module.vpc.aws_route_table_association.private[2] will be updated in-place
~ resource "aws_route_table_association" "private" {
        id             = "rtbassoc-0d533b035d7447717"
      ~ route_table_id = "rtb-0ac987108fa00c25e" -> "rtb-060d6af86f9351b21"
        # (1 unchanged attribute hidden)
    }

  # module.vpc.aws_route_table_association.private[3] will be updated in-place
~ resource "aws_route_table_association" "private" {
        id             = "rtbassoc-0b72c21be430d5b58"
      ~ route_table_id = "rtb-08b21614179af2ea6" -> "rtb-060d6af86f9351b21"
        # (1 unchanged attribute hidden)
    }

  # module.vpc.aws_route_table_association.private[4] will be updated in-place
~ resource "aws_route_table_association" "private" {
        id             = "rtbassoc-0c9ceb69ba8df46b8"
      ~ route_table_id = "rtb-09ff56cbd3383e828" -> "rtb-060d6af86f9351b21"
        # (1 unchanged attribute hidden)
    }

Plan: 3 to add, 10 to change, 8 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p cco-tf-demo`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.2w.laiello.com/lock?id=2ndWatch%252Fcco-tf-demo%252Finfrastructure%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p cco-tf-demo`
</details>

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
